xtee55/servicemediator/src/test/resources/invalid-listMethods.response

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="MEMBER">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>riigiasutus</id:memberClass>
            <id:memberCode>ppa</id:memberCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>riigiasutus</id:memberClass>
            <id:memberCode>kiiruskaameraregister</id:memberCode>
            <id:serviceCode>xroadGetRandom</id:serviceCode>
        </xroad:service>
        <xroad:userId>27001010001</xroad:userId>
        <xroad:id>testquery4</xroad:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:xroadGetRandom xmlns:ns1="http://consumer.ee.xroad.net">
            <request>
                <seed>123</seed>
            </request>
        </ns1:xroadGetRandom>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
